src/DataProcessors/ПанельСправочниковВнеоборотныеАктивы/ПанельСправочниковВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельСправочниковВнеоборотныеАктивы</name>
</mdclass:DataProcessor>

src/Catalogs/КлассыОбъектовЭксплуатации/КлассыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассыОбъектовЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПодклассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтныйЦиклПоНаработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКлассУзла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтныйЦикл</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоНаработке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиНаработки</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьОстаточныйРесурс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРегистрации</name>
      <type>
        <types>EnumRef.СпособыРегистрацииНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьОтИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьРегистрации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПересчитыватьСреднесуточноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыДляКонтроля</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПанельСправочниковВнеоборотныеАктивы/Forms/ВнеоборотныеАктивы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВнеоборотныеАктивыЛокализация.ПриСозданииНаСервере_ПанельСправочниковВнеоборотныеАктивы(ЭтаФорма);
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПоказателиНаработки(Команда)
	
	ОткрытьФорму("Справочник.ПоказателиНаработки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов(Команда)
	
	ОткрытьФорму("Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытияОС(Команда)
	
	ОткрытьФорму("Справочник.СобытияОС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыОС(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ГруппыОСМеждународныйУчет.ФормаСписка");
	//-- НЕ УТКА
	
	Возврат; // В КА пустой обработчик.
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыНМА(Команда)
	
	ОткрытьФорму("Справочник.ГруппыНМА.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЕГДС(Команда)
	//++ НЕ УТ
	ОткрытьФорму("Справочник.ЕдиницыГенерирующиеДенежныеСредства.Форма.ФормаСписка");
	//-- НЕ УТ
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассыОбъектовЭксплуатации(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.КлассыОбъектовЭксплуатации.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщиеВидыРемонтов(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ОбщиеВидыРемонтов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДефектов(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.ВидыДефектов.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	Возврат; // В КА пустой обработчик.
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРемонтныеМероприятия(Команда)
	
	//++ НЕ УТКА
	ОткрытьФорму("Справочник.РемонтныеМероприятия.ФормаСписка", , ЭтаФорма);
	//-- НЕ УТКА
	Возврат; // В КА пустой обработчик.

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКатегорииЭксплуатации(Команда)
		
	ОткрытьФорму("Справочник.КатегорииЭксплуатации.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриВыполненииКоманды(Команда)

	ВнеоборотныеАктивыКлиентЛокализация.ПриВыполненииКоманды_ПанельСправочниковВнеоборотныеАктивы(Команда, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()

	ЕстьПраваКРемонтам = Ложь;
	//++ НЕ УТКА
	ЕстьПраваКРемонтам =
		ПравоДоступа("Просмотр", Метаданные.Справочники.КлассыОбъектовЭксплуатации)
		ИЛИ ПравоДоступа("Просмотр", Метаданные.Справочники.ОбщиеВидыРемонтов)
		ИЛИ ПравоДоступа("Просмотр", Метаданные.Справочники.РемонтныеМероприятия)
		ИЛИ ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДефектов);
	//-- НЕ УТКА
	
	Элементы.ОткрытьПоказателиНаработки.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиНаработки)
		И НЕ ЕстьПраваКРемонтам;
	
	Элементы.ОткрытьГруппыФинансовогоУчетаВнеоборотныхАктивов.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ГруппыФинансовогоУчетаВнеоборотныхАктивов);

	Элементы.ОткрытьСобытияОС.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.СобытияОС);
	
	//++ НЕ УТКА
	Элементы.ОткрытьКлассыОбъектовЭксплуатации.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.КлассыОбъектовЭксплуатации);
	
	Элементы.ОткрытьОбщиеВидыРемонтов.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ОбщиеВидыРемонтов);
	
	Элементы.ОткрытьРемонтныеМероприятия.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.РемонтныеМероприятия);
	
	Элементы.ОткрытьВидыДефектов.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Справочники.ВидыДефектов);
	
	Элементы.ОткрытьПоказателиНаработкиРемонты.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Справочники.ПоказателиНаработки)
		И ЕстьПраваКРемонтам;
	//-- НЕ УТКА	
	
	ВнеоборотныеАктивыЛокализация.УправлениеЭлементами_ПанельСправочниковВнеоборотныеАктивы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
